{"title":"BuzzFeed Design - Medium","description":"Not just GIFs. Okay, mostly GIFs. - Medium","link":"https://medium.com/buzzfeed-design?source=rss----60b3a6f3294f---4","updated":"Wed, 05 Dec 2018 22:39:10 GMT","updatedParsed":"2018-12-05T22:39:10Z","author":{"email":"yourfriends@medium.com"},"image":{"url":"https://cdn-images-1.medium.com/proxy/1*TGH72Nnw24QL3iV9IOm4VA.png","title":"BuzzFeed Design - Medium"},"generator":"Medium","extensions":{"atom":{"link":[{"name":"link","value":"","attrs":{"href":"https://medium.com/feed/buzzfeed-design","rel":"self","type":"application/rss+xml"},"children":{}},{"name":"link","value":"","attrs":{"href":"http://medium.superfeedr.com","rel":"hub"},"children":{}}]}},"items":[{"title":"What It’s Like To Intern As A Product Designer At BuzzFeed","content":"\u003cp\u003eWe went in a clockwise motion around the boardroom table sharing our biggest pet peeves: inconsiderate dog owners that walk faster than their pups can follow, the haunting gap left by the door when someone leaves your room, and pesty alligators that block off roads (a Florida thing). I was less than an hour into the intern orientation at BuzzFeed, and this refreshing round of ice-breakers had shaken off all my first-day jitters. Somehow, I could already tell the summer would be a special one… \u003cem\u003eand I hadn’t even gotten the office tour yet.\u003c/em\u003e\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/360/1*ah1A7QOPixXetowaVMgptA.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*-gm_UzCiNpZMRWlTyup8BA.gif\" /\u003e\u003cfigcaption\u003eMuch love to our lobby security guard for offering me his spot for this Polaroid shot. It’s not thin air I’m pointing at — just a grainy BuzzFeed logo 😅\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eHow I Landed The Gig\u003c/h3\u003e\u003cp\u003eEarlier this January, during my last semester at Georgia Tech, I found myself still stuck in the “yikes-what-am-I-doing-with-my-life-after-graduation” phase. Sure, I had five months left before officially relinquishing my student status, but rejections from on-site interviews in the fall left me in a mildly defeated state.\u003c/p\u003e\u003cp\u003eAround this time, I luckily stumbled upon the Medium article, \u003ca href=\"https://medium.com/buzzfeed-design/be-buzzfeeds-product-design-intern-this-summer-37925aef84b0\"\u003e“Be BuzzFeed’s Product Design Intern This Summer,”\u003c/a\u003e which highlighted an opportunity that seemed perfect to venture into. It appeared to be a great way for me to get a definitive answer between pursuing a career in software engineering and product design. Not to mention, it seemed like an priceless experience where I would be able to grow immensely as a designer; I’ve always valued the saying “If you’re the smartest person in the room, you’re in the wrong room.”\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*eH_DYSzCFMGnj5n3wJAyfg.png\" /\u003e\u003cfigcaption\u003eFind more articles about designing at BuzzFeed \u003ca href=\"https://medium.com/buzzfeed-design\"\u003ehere\u003c/a\u003e!\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFast forward to February — I receive an email from \u003ca href=\"https://twitter.com/kelsa_\"\u003eKelsey\u003c/a\u003e, one of the design managers. She wanted to hop on a 15-minute intro video call to learn a bit more about me as a candidate. Thankfully, we had a great conversation, leading me to the portfolio presentation round with BuzzFeed’s other design manager, \u003ca href=\"https://twitter.com/cayleebetts\"\u003eCaylee\u003c/a\u003e. I set up a slide-deck that showcased two personal projects from conception to launch, which included the messiest parts of my processes: what I tried that didn’t work, variations I came up with before narrowing down to the one I shipped, and things I would’ve done differently. The final interview was to understand more about my interest in BuzzFeed, what I was looking to learn from the summer, and how I thought BuzzFeed could help me with this. We also touched on how I work with others and approached collaboration.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*TbEgJEWzAUU_NiTyTXC7Vg.png\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1017/1*2GhnMIlUX618qIjSmBjpmw.png\" /\u003e\u003cfigcaption\u003eTwo actual slides from my portfolio presentation: a shameless “I shoot travel photography” fun fact and an introduction to my design project at DoorDash.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eA late Friday afternoon in March, while I was out in San Francisco attending \u003ca href=\"https://www.ideocolab.com/\"\u003eIDEO CoLab’s\u003c/a\u003e Makeathon, I received an unexpected call from \u003ca href=\"https://twitter.com/cayleebetts\"\u003eCaylee\u003c/a\u003e to notify me that I had gotten the offer! Looking back, I have to give kudos to the team on their response time, the transparency of the entire candidacy process, and for respecting my timeline with other companies. Shortly after, I accepted the role and the rest is history.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eFun fact\u003c/em\u003e\u003c/strong\u003e: I reached out to former 2017 product design intern, \u003ca href=\"http://derrickhho.com/\"\u003eDerrick\u003c/a\u003e, shortly after receiving my offer to ask him more about his experience. After we realized we would both be in London the following week, we met up in person and grabbed dinner and drinks with our combined friend groups!\u003c/p\u003e\u003ch3\u003eContributions? I Made Some.\u003c/h3\u003e\u003cp\u003eA week before my first day, I learned I was placed on the \u003ca href=\"https://tasty.co/\"\u003eTasty\u003c/a\u003e team — pretty fitting for a huge foodie like me. My first project was to design a feature that would display nutritional information across the Tasty website and app. On my second day of work, I quickly understood how highly requested of a feature it was: I was sifting through a couple hundred relevant support tickets to better understand our users’ needs. Additionally, I researched popular diets and dietary restrictions to learn more about what was most important to show. After sharing my concepts with my mentor during check-ins, the rest of the design team in critique meetings, and Tasty product managers, I finalized designs so it could be built in the future.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ZhC6cZGs-FH2wXF1sgi3-g.jpeg\" /\u003e\u003cfigcaption\u003eMy design sprint squad scrambling to fill up their boxes during our \u003ca href=\"https://designsprintkit.withgoogle.com/methods/sketch/crazy-8s/\"\u003ecrazy 8’s activity\u003c/a\u003e.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eMy second project was focused on creating a new “lean-back” experience for Tasty users who want to predominantly consume video content. The goals were to increase view count and offer a more seamless transition from one recipe page to another. We wanted to do this by creating an entertainment-centric way to watch our videos, as most of our viewership stems from Facebook and Instagram sources.\u003c/p\u003e\u003cp\u003eThe first week, I started off the project by catching up on our internal research relating to videos. I also created a slide-deck that detailed my analyses on popular video trends across recipe platforms, entertainment hubs, social media networks, and news outlets. Then, I planned and hosted my very own internal design sprint comprised of seven participants: designers, engineers, a data scientist, and a product manager across various teams at BuzzFeed. I brought in donuts to try and compensate for their generous donation of an hour and half of their workday.\u003c/p\u003e\u003cp\u003eI ended up grabbing some great ideas from the sprint and then spent some time sketching explorations on my own. After finalizing on four concepts to test, I set up video calls with Tasty users to conduct research studies. It was my first time, so I was pretty nervous, but I ended up having so much fun with all my interactions. In addition to the comments they provided on the prototypes, users didn’t hold back from telling me how much they loved Tasty. One user mentioned how much his granddaughter enjoyed making our desserts, and another mentioned how she and her husband cook our recipes together (\u003cem\u003eaw\u003c/em\u003e). Special shoutout to Elaine, \u003ca href=\"https://twitter.com/HanaCarpenter\"\u003eHana\u003c/a\u003e, and \u003ca href=\"https://twitter.com/thewindcriesami\"\u003eSami\u003c/a\u003e who helped me take notes during my sessions! After wrapping up my findings, I went through more cycles of iteration (with feedback from mentors in between) before speaking with PMs and engineers regarding my final design decisions.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*YaxT0BBQnsipkOBEBrGWhA.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*QY4vtoMslWEFAM-H4mpDuw.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*TqglKbLB4xEBNJ5vaxJzrw.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*8-rYKAFhNqOwcVRRfUcuiw.jpeg\" /\u003e\u003cfigcaption\u003ePeep these on the Tasty iPad and BuzzFeed iOS app store!\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAside from my main projects, I helped design promotional artwork for the Tasty and BuzzFeed iOS apps and curated the \u003ca href=\"https://tech.buzzfeed.com/we-were-the-2018-buzzfeed-intern-class-and-now-were-crying-in-the-club-because-summer-s-over-dba1dcb85e0a\"\u003e“We Were The 2018 BuzzFeed Intern Class And Now We’re Crying In the Club Because Summer’s Over”\u003c/a\u003e article. I also led a re-design for the BuzzFeed careers page for Hack Week. Although my team didn’t manage to get a working demo by the end of the week, the VP of Engineering still gave us a personal shoutout.\u003c/p\u003e\u003ch3\u003eNovice Designer → Not-So-Novice Designer.\u003c/h3\u003e\u003cp\u003eIt’s hard to stress how many resources there are for a junior designer like myself to grow at BuzzFeed. On Mondays, senior designers host “Study Hall,” similar to office hours for design. On Tuesdays and Thursdays, we engage in critique meetings where we share our work for a combined six hours. On every other Friday, we host Design Club where a designer comes into the office for an hour to share his or her journey. I always left the talks super inspired — similar to the feeling I get when I finish watching TED videos that make me question my collective life choices. I had two weekly check-ins with my manager, \u003ca href=\"https://twitter.com/sofimilli\"\u003eSofia\u003c/a\u003e, as well as one with my mentors, \u003ca href=\"https://medium.com/@celine.chang\"\u003eCeline\u003c/a\u003e and Caitlin. To add onto all this, no one at BuzzFeed ever turned me down for a coffee or lunch chat if I asked. It was genuinely so rewarding to be surrounded by a myriad of opportunities to grow as a budding creative.\u003c/p\u003e\u003cp\u003eAside from picking up new Sketch shortcuts and learning how to link GIFs into Google Slides, I’ve gained some valuable takeaways from this internship that will stay with me as I continue on in my career. I learned that it’s important to continuously ask for feedback no matter what phase of the design process you’re in, to involve product managers’ and engineers’ judgements as early as you can, and that design processes can differ contrastingly from project to project. Designing for real-life audiences has given me a perspective that no university class could ever provide me with.\u003c/p\u003e\u003ch3\u003eHaving Fun At Work?!\u003c/h3\u003e\u003cp\u003eGasp, how scandalous. Well, it’s true — you can have the best of both worlds, especially at a magical place like BuzzFeed. When I wasn’t creating pixel-perfect designs at the office, I was meeting celebrities, playing with puppies, and eating all the leftovers from our Tasty kitchens.\u003c/p\u003e\u003cp\u003eQuite honestly, celebrity spottings were almost too common for my own good. I had the chance to meet Henry Golding, lead actor of \u003cem\u003eCrazy Rich Asians\u003c/em\u003e, and listen to him talk about his route to stardom in his charming accent. He featured me, \u003cem\u003eahem\u003c/em\u003e I mean our group photo, on his \u003ca href=\"https://www.instagram.com/p/BkVR51klAN3/?taken-by=henrygolding\"\u003eInstagram page\u003c/a\u003e! I was also serenaded by both Jesse McCartney, my teenage heartthrob, and Mason Ramsey, acclaimed yodeler, when they stopped by as guests for our Music Break Tuesdays.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/898/1*gk58mEgFSpYEvtlqgoGRng.png\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*rUpy3pFduuBPr_j92p20qQ.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FjfY4L8tgAEsdyFUlWSV9w.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Tu14kKhCScdAuk2GdySLfQ.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*KvL0xLdd7tibkU4z8kCKnA.jpeg\" /\u003e\u003cfigcaption\u003eAll the memz 😭💖.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eI had my own taste of short-lived fame when I took over the \u003ca href=\"http://twitter.com/buzzfeedexp\"\u003eBuzzFeed EXP Twitter\u003c/a\u003e handle with my partner-in-crime, \u003ca href=\"https://twitter.com/jarvmiller\"\u003eJarvis\u003c/a\u003e (another intern). For a week, we documented our day-to-day’s and ended up creating a \u003ca href=\"https://www.buzzfeed.com/nikhilsethi/which-buzzfeed-exp-intern-are-you-3i473\"\u003e“Which BuzzFeed EXP Intern Are You?”\u003c/a\u003e quiz with other colleagues. As a result, people from all over were tweeting at me with their screen-shotted answers, including our \u003ca href=\"https://twitter.com/cap/status/1009546294724087810\"\u003eformer VP of Design who promised me a souvenir from Japan\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eEvery Friday, we had themed happy hours. I was able to help out with chalking when BuzzFeed’s Asian employee resource group — A*FAMILY — hosted theirs, despite holding no skills in the 3D word art department. During BuzzFeed’s “Global Week of Service,” I “volunteered” time out of my day to spend with puppies from the local rescue organization, Rescue City.\u003c/p\u003e\u003cp\u003eThe list goes \u003cem\u003eon and on and on\u003c/em\u003e. Did I mention I had a lot of fun?\u003c/p\u003e\u003ch3\u003eEnding Remarks\u003c/h3\u003e\u003cp\u003eAll in all, I couldn’t have asked for a better internship. BuzzFeed is home to some of the coolest people I’ve had the privilege of surrounding myself with. Ironically, back in 2013, I visited BuzzFeed’s old office on a \u003ca href=\"https://girlswhocode.com/\"\u003eGirls Who Code\u003c/a\u003e class trip. Who knew my life would come full circle and that I’d be interning here five years later? Thanks again to the product design team, the Tasty team, and the intern fam for these memorable few months — this summer was definitely one for the books 😜.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/653/1*wq_WjYwvEBg5cEBQH6jdLQ.jpeg\" /\u003e\u003cfigcaption\u003e16-year old Michelle had no idea what was coming.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cem\u003eAn open invitation to all readers: feel free to reach out regarding any questions you may have! My email and social media handles can be found on my \u003c/em\u003e\u003ca href=\"http://michelle-chiu.com/\"\u003e\u003cem\u003ewebsite\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eInterested in becoming an intern yourself? Keep an eye out for internship postings on the BuzzFeed jobs page \u003c/em\u003e\u003ca href=\"https://tech.buzzfeed.com/r/?url=https%3A%2F%2Fwww.buzzfeed.com%2Fabout%2Fjobs\"\u003e\u003cem\u003ehere!\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTo keep in touch with us here and find out what’s going on at BuzzFeed Tech, be sure to follow us on \u003c/em\u003e\u003ca href=\"https://tech.buzzfeed.com/r/?url=http%3A%2F%2Ftwitter.com%2Fbuzzfeedexp\"\u003e\u003cem\u003eTwitter @BuzzFeedExp\u003c/em\u003e\u003c/a\u003e\u003cem\u003e where a member of our Tech team takes over the handle for a week!\u003c/em\u003e\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=d30ec89c1d3a\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/what-its-like-to-intern-as-a-product-designer-at-buzzfeed-d30ec89c1d3a\"\u003eWhat It’s Like To Intern As A Product Designer At BuzzFeed\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/what-its-like-to-intern-as-a-product-designer-at-buzzfeed-d30ec89c1d3a?source=rss----60b3a6f3294f---4","published":"Wed, 15 Aug 2018 20:02:19 GMT","publishedParsed":"2018-08-15T20:02:19Z","author":{"name":"Michelle Chiu"},"guid":"https://medium.com/p/d30ec89c1d3a","categories":["buzzfeed","tech","internships","design","product-design"],"dcExt":{"creator":["Michelle Chiu"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2018-08-18T15:53:58.357Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Michelle Chiu","attrs":{},"children":{}}]}}},{"title":"Be BuzzFeed’s Product Design Intern This Summer!","content":"\u003cp\u003eInternships come in many flavors, from the big companies that provide a first-hand view into how Product Design operates at scale through huge intern cohorts, to the tiny startups with more ad hoc, self-directed approaches. At BuzzFeed we’re somewhere in between. We’re limited in how many interns we’re able to take on — last summer there were two, previous years we’ve had only one. As a result, every intern becomes a very real and valuable member of our team, tackling high-impact design problems and collaborating with Designers, Engineers and Product Managers across the company.\u003c/p\u003e\u003cp\u003eIn addition to seeing how a tech and media organization operates at scale you’ll also get to be a full-time member of the Product Design team, receiving feedback on your work in bi-weekly critiques, workshopping your design ideas as part of Study Halls (run by senior designers), receiving design direction from your Design Manager and even having a dedicated design mentor to ask questions to.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.buzzfeed.com/montanar49316ea17/20-reasons-no-internship-will-ever-be-better-than-2g2cw?utm_term=.rdxo6nrp2Q#.lyDp7Q8Y2q\"\u003eBuzzFeed’s intern program\u003c/a\u003e means you won’t be alone! You’ll get to meet and work with a bunch of interns across the tech team and beyond. Oh and did I mention fun? Obviously, BuzzFeed is a very serious organization where there is no fun ever—especially not spinning on chairs, cruising around Manhattan on a sailboat, participating in our annual hackweek or taking a break from work to play a game at BuzzFeed’s summer carnival.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/382/1*krpC7Ba7hy5Wq-fJGZZ__Q.gif\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*KaF_d6US76RXeWFtrsLxiw.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/382/1*P086SikAEv3U3XmgLcGA_Q.gif\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*WVFRlSn4bNAa6-Qnlo0Y0g.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*qGSGl5ABPSwGmmrTX5pSTQ.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*3oua9B_IQJSfIETXa1Tz5w.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*qwFl1wDyURSsapVEOxKp1A.jpeg\" /\u003e\u003c/figure\u003e\u003ch3\u003eWhat you’ll work on\u003c/h3\u003e\u003cp\u003eThings move quickly at BuzzFeed so projects that exist now will look very different by the time NYC warms up. As a result it’s impossible to know now exactly what you’ll be working on. What we can say is that it’ll be valuable, high-impact work that contributes to our company and audience in very tangible ways. Recent interns have worked on things such as a consumer-facing infographic creation tool, an Alexa skill, a tool for helping track our annual review process and UI improvements to BuzzFeed’s core quiz-taking experience and our Tasty iOS app.\u003c/p\u003e\u003cp\u003eStill unsure what to expect? Perhaps our interns from last summer can provide a bit more insight:\u003c/p\u003e\u003cblockquote\u003e“I got to build a product from A-Z over the summer. That was pretty epic, and even more so was being surrounded by and getting feedback from really talented designers . I love(d) BuzzFeed so much that I ended up staying on full time!” — \u003ca href=\"https://twitter.com/nogaraviv\"\u003eNoga Raviv\u003c/a\u003e\u003c/blockquote\u003e\u003cblockquote\u003e\u003cem\u003e“I had the chance to learn about so much from not only an immensely talented design team, but also data scientists, developers, PMs, and upper level management. The company really gives you flexibility to work on products/teams that interest you and makes you feel like an integral part of the team. It truly was amazing and I can’t speak enough about the quality of the people there. I also had the chance to be in a BuzzFeed video which was really cool.” — \u003c/em\u003e\u003ca href=\"http://derrickhho.com/\"\u003e\u003cem\u003eDerrick Ho\u003c/em\u003e\u003c/a\u003e\u003c/blockquote\u003e\u003ch3\u003eWhat we’re looking for\u003c/h3\u003e\u003cp\u003eOur expectations for interns are similar to what we’d look for in associate designers, details of which are documented in \u003ca href=\"https://github.com/buzzfeed/design/blob/master/product-design-roles.md#associate_product_designer\"\u003eour roles doc\u003c/a\u003e. A portfolio that demonstrates at least one in-depth Product Design project—we favor quality over quantity—with details of the process you went through and artifacts created along the way is often the easiest way for us to understand your capabilities and how well they suit how BuzzFeed operates. We’re most interested in raw Product Design talent and evidence of designing products within real-world constraints i.e. deeply understanding user needs, business goals and technical limitations. We understand many candidates won’t have extensive in-house work experience, but respect creative approaches to meeting the criteria above through self-initiated projects or other means.\u003c/p\u003e\u003ch3\u003eThe Application Process\u003c/h3\u003e\u003ch4\u003e\u003cstrong\u003eFeb 4— Portfolio submission deadline\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWe know, this is soon! On Feb 5, Design Managers will start reviewing all applications to date, reducing to a short list of the most promising candidates.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eFebruary — Interviews\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eOur initial conversation will last about 30 minutes and focus on your hard skills i.e. User Experience, Visual Design, Prototyping and Front-End code. We’ll ask you to walk us through a project that clearly communicates these things along with the design process you went through for it. This conversation will happen with a Design Manager over video chat.\u003c/p\u003e\u003cp\u003eFor those who successfully complete the first interview you’ll have another 30 minute conversation with someone else on the Product Design team to understand more about your interest in BuzzFeed, what you’re looking to learn from the summer and how you think BuzzFeed will help you with this. This second conversation focuses on how well suited this pairing could be, in addition to following up on any open questions resulting from the first interview.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eMarch — Finalize candidates\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eFollowing these interviews Design Managers will re-group to compare notes and finalize the most well suited candidates. After making an offer we’ll communicate with everyone who applied to let them know we’ve reached the end of our process for the year.\u003c/p\u003e\u003ch3\u003eAnd finally, internship specifics\u003c/h3\u003e\u003cp\u003eYou’ve made it this far—awesome! Before going any further please make sure to read the following requirements:\u003c/p\u003e\u003cul\u003e\u003cli\u003eYou must be available to be onsite in our NYC office June 4–August 10 (10 weeks). You’ll be part of a wider \u003ca href=\"https://www.buzzfeed.com/montanar49316ea17/20-reasons-no-internship-will-ever-be-better-than-2g2cw?utm_term=.upLkeozDmd#.ac2POKRZX8\"\u003eBuzzFeed internship program\u003c/a\u003e so we can’t adjust the timeline significantly.\u003c/li\u003e\u003cli\u003eYou must be legally eligible to work in the US.\u003c/li\u003e\u003cli\u003eYou’ll be paid fairly, inline with tech industry intern standards.\u003c/li\u003e\u003cli\u003eWe’re unable to offer a housing stipend.\u003c/li\u003e\u003cli\u003eWe know Designer is a broad term — we have graphic designers, brand designers and editorial designers on staff! For this internship we’re \u003cem\u003eonly\u003c/em\u003e considering Product Designers i.e. designers with evidence of User Interface and User Experience work for software products.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAll that’s left to say is:\u003c/p\u003e\u003ch4\u003eFeb 5, 2018 Update—We’re No Longer Accepting Applications\u003c/h4\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*uZAUxQMBwsgTKvu29HT4Ow.jpeg\" /\u003e\u003cfigcaption\u003eDerrick \u0026amp; Noga on BuzzFeed NYC’s rooftop that you too will be able to hang out on this summer!\u003c/figcaption\u003e\u003c/figure\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=37925aef84b0\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/be-buzzfeeds-product-design-intern-this-summer-37925aef84b0\"\u003eBe BuzzFeed’s Product Design Intern This Summer!\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/be-buzzfeeds-product-design-intern-this-summer-37925aef84b0?source=rss----60b3a6f3294f---4","published":"Thu, 25 Jan 2018 16:49:27 GMT","publishedParsed":"2018-01-25T16:49:27Z","author":{"name":"Tom Harman"},"guid":"https://medium.com/p/37925aef84b0","categories":["tech","internships","summer-internships","product-design","media"],"dcExt":{"creator":["Tom Harman"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2018-02-06T23:56:51.958Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Tom Harman","attrs":{},"children":{}}]}}},{"title":"Product Design Roles v3","content":"\u003cp\u003eJust over a year ago, we posted \u003ca href=\"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74\"\u003ea major overhaul of our Product Design Roles documentation\u003c/a\u003e. With that revision, we aimed for our role documentation to facilitate more actionable discussions between managers and their teams, set clearer expectations for each level, as well as help our designers and design managers set better goals. And while we’ve gotten a lot of positive feedback from our team over the past year, we’ve also noticed a few holes and areas we could improve our documentation. After going through a couple of performance review cycles and running our now-annual \u003ca href=\"http://blog.capwatkins.com/the-great-reanchoring\"\u003eProduct Design Offsite\u003c/a\u003e, we had the feedback we needed to evolve our documentation.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*IlKIaCgj6hmKC9q0EeTpIw.gif\" /\u003e\u003cfigcaption\u003eThe problem that role documentation should solve.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eWhat We Discovered\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eNo one knew how to get promoted. \u003c/strong\u003eWhile the documentation was pretty solid for understanding the expectations of each level once you were there, there was no guidance for designers on which skills we felt were must-haves for promotion. Even amongst the managers, there was disagreement about which skills were most important and when a designer was ready to take on more responsibility.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSome of the language was unclear. \u003c/strong\u003eIn the past year, we’ve begun doing an exercise with the Product Design team (designers and managers both) that we call Calibration. We make a spreadsheet with every skill from the role document listed, and ask each designer to indicate what level they think they’re at for each skill based on the existing documentation. Separately, their manager also fills out a duplicate spreadsheet about that designer from their perspective. And then, the designer and manager get together and compare their results side-by-side. If that’s confusing, here’s what it looks like in practice after both designer and manager have combined their spreadsheets:\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*vIz9qG3gtfSZ00uhdYpR0Q.png\" /\u003e\u003cfigcaption\u003eWe highlight areas of disagreement between managers and their team members.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWe’ve found this to be an amazing tool for ensuring managers and their team members stay aligned, as well as for sparking interesting conversations when there’s misaligned perspectives. We found while some of the misalignments were simple disagreements, we also found that our documentation, at times, lacked clarity and created different perceptions of what the document even meant.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThere were some skills we clearly cared about day-to-day and at review time, but had failed to cover. \u003c/strong\u003eFor instance we covered writing, but no other forms of communication (cue forehead-slap). Or we covered running quantitative experiments, but it turned out a lot of designers were running their own qualitative studies (and we just hired our first full-time User Researcher!). But the overlap between the two types of data and expectations for how designers gather and work with data were not represented at all. Yet we talked a lot about these things all the time!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOrganization-specific language was old and outdated. \u003c/strong\u003eWe had a lot of terminology in our role document that was specific to how we were organized at the time we wrote the doc. Terms like “councils” or even “groups” and “squads” turned out to not be durable enough and had stopped making sense entirely based on how our department had evolved.\u003c/p\u003e\u003ch3\u003eWhat We Did\u003c/h3\u003e\u003cp\u003eWe’ve cleaned up a lot of the wording and even rewritten entire skills to make the expectations clearer than ever before. We’ve removed all org-specific language, and added new skills (and combined a few) to cover all of the things we expect from designers.\u003c/p\u003e\u003cp\u003eAdditionally, we’ve added clarity around which skill is a requirement in order to get promoted for each level. In the final document, you’ll find asterisks next to certain skills at each level. When we’re talking to designers about what they need to work on to pursue promotion, we use those asterisks.\u003c/p\u003e\u003cp\u003eFinally, we’ve moved our role documentation (and will be moving more of our documents soon) to Github! This allows us to open Pull Requests against our existing document, make changes and share those changes with the team prior to finalizing and merging it in. We’ve made the repo open and attached the GNU Free Documentation license to it so anyone can grab the docs we’ve made and use them however they want.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/480/1*HM9jGjprumjRM96Lsxr91Q.gif\" /\u003e\u003cfigcaption\u003eYeah!\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eFAQ\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eWhat about the manager roles? \u003c/strong\u003eGood catch! We haven’t tackled the manager roles, though that is my very next step and coming soon! The designer roles impacted the most people on the team and were most in need of adjustment, so we chose to start there.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDoesn’t this raise the bar? \u003c/strong\u003eI was talking to \u003ca href=\"https://twitter.com/sabrina\"\u003eSabrina\u003c/a\u003e, one of our amazing design managers, about the possibility that changing this document could be perceived as moving the bar on people. She replied that, from her perspective, it wasn’t the bar that had changed, but rather our ability to articulate where the bar is. In other words, this new document reflects what we’ve always considered the expectations for the Product Design team, but in a clearer way than we’ve been able to before now.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWill you revise this every year? \u003c/strong\u003eThat’s the current plan! As we use this new document more, we’ll be learning its strengths and weaknesses, and will think about what the next iteration should cover sometime next summer after our yearly Product Design Offsite.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhat other documentation will you release on Github? \u003c/strong\u003eWe’re planning to transition all of our recruiting and design process documentation to this repository. We’ll be making more announcements as we flesh out the structure there. This is definitely just a first step into a much larger world.\u003c/p\u003e\u003cp\u003eWe’re super excited to have this document for our team and, as always, to share our documentation with the entire design community. Hit us up in the comments with any questions or thoughts. We’d love to hear them!\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://github.com/buzzfeed/design/blob/master/product-design-roles.md\"\u003eView Our Product Design Roles Doc »\u003c/a\u003e\u003c/h3\u003e\u003ch3\u003e\u003ca href=\"https://github.com/buzzfeed/design\"\u003eCheck Out Our Full GitHub »\u003c/a\u003e\u003c/h3\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=c97a061a4b33\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/product-design-roles-v3-c97a061a4b33\"\u003eProduct Design Roles v3\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/product-design-roles-v3-c97a061a4b33?source=rss----60b3a6f3294f---4","published":"Mon, 12 Jun 2017 14:56:58 GMT","publishedParsed":"2017-06-12T14:56:58Z","author":{"name":"Cap Watkins"},"guid":"https://medium.com/p/c97a061a4b33","categories":["design","management","leadership"],"dcExt":{"creator":["Cap Watkins"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2017-06-12T14:56:58.633Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Cap Watkins","attrs":{},"children":{}}]}}},{"title":"BuzzFeed’s Product Design Principles","content":"\u003ch4\u003eAnd how we got here\u003c/h4\u003e\u003cp\u003eThe Product Design team here at BuzzFeed has spent the last couple years polishing up our\u003ca href=\"https://medium.com/buzzfeed-design/introducing-solid-1c16b1bf4868\"\u003e tools\u003c/a\u003e and revamping\u003ca href=\"https://medium.com/buzzfeed-design/introducing-buzzfeeds-design-process-4fefbdcd83ea\"\u003e processes\u003c/a\u003e — and it’s been \u003cem\u003erad\u003c/em\u003e. But our improvements in some areas have illuminated other rough patches. One of those rough patches: designers didn’t always seem to be following the same guiding principles when providing critique or making decisions on our own design work.\u003c/p\u003e\u003cp\u003eWhen sharing work in critique or Basecamp, the feedback would often sound a bit like this:\u003c/p\u003e\u003cblockquote\u003e\u003cstrong\u003eDesigner A:\u003c/strong\u003e I prefer option A because it’s really fun.\u003c/blockquote\u003e\u003cblockquote\u003e\u003cstrong\u003eDesigner B: \u003c/strong\u003eI don’t know, I don’t like fun.\u003c/blockquote\u003e\u003cblockquote\u003e\u003cstrong\u003eDesigner C:\u003c/strong\u003e Do we care about it being fun?\u003c/blockquote\u003e\u003cblockquote\u003e\u003cstrong\u003eDesigner B: \u003c/strong\u003eI don’t know, it doesn’t seem… BuzzFeedy?\u003c/blockquote\u003e\u003cp\u003eBeing people with emotions, we can’t possibly avoid these types of conversations altogether, but we thought we could avoid \u003cem\u003esome\u003c/em\u003e of them if we had a shared understanding of what we care about most in our products.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*6FbdjwmFsVxLcPSpEypl9w.png\" /\u003e\u003cfigcaption\u003eDesign for scale — Art by Celine Chang\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eOur Product Design Principles\u003c/h3\u003e\u003cp\u003eI’ll explain a bit about the process and path forward, but for those looking to cut to the chase and see them, here you go:\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eDelight with speed.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eUse design to make our products feel fast and responsive.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eKeep it fresh.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eUse bold, high-contrast designs to bring focus and clarity to key actions or information, and to represent BuzzFeed’s youthful brand.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eKnow the goals.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWhen designing, whether in sketches, wireframes or multiple high-fidelity options, our work should always reflect the product goals.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eConsider the ecosystem.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eDesign modules and write copy with an awareness of all the places they may show up, as well as which types of BuzzFeed content they may appear with.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eDesign with the platform.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eBalance native platform elements and patterns with BuzzFeed’s own design patterns and content. Our products should behave natively, while remaining uniquely BuzzFeed.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eAdvocate for our users.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eIt’s our responsibility to understand our users’ needs, as well as to advocate for them with our teams and in our work.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003ePair simplicity with delight.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eDesign purposeful interfaces that favor usability, while also infusing delight through color, animation and language.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eDesign for scale.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eDesign with an eye toward the future of our products. Value flexible, scalable designs that can quickly evolve alongside our content.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eLearn, learn again.\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eKnow the data surrounding your product well enough to discuss, describe and deeply inform your design work. Constantly validate your ideas through A/B testing or qualitative analysis.\u003c/p\u003e\u003ch3\u003eThe process\u003c/h3\u003e\u003ch4\u003eThe goal\u003c/h4\u003e\u003cp\u003eThe primary goal of these Product Design principles is to establish a set of values to help inform our work, and serve as another tool for decision-making during the design process. Our hope is that with these in mind, our growing team can make faster, more consistent product design decisions that work \u003cem\u003efor BuzzFeed\u003c/em\u003e.\u003c/p\u003e\u003ch4\u003eGenerating ideas\u003c/h4\u003e\u003cp\u003eAfter taking a look at what other designers have done in this space for some inspiration, I facilitated\u003ca href=\"https://library.gv.com/note-and-vote-how-to-avoid-groupthink-in-meetings-24e829e43295\"\u003e note and vote\u003c/a\u003e sessions with members of our Product Design team. The first session, focused on \u003cstrong\u003euser experience, \u003c/strong\u003eattempted to answer questions like:\u003c/p\u003e\u003cul\u003e\u003cli\u003eWhat do we most value as product designers at BuzzFeed?\u003c/li\u003e\u003cli\u003eWhat is unique about how we think about the user experience at BuzzFeed?\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe second brainstorm centered around \u003cstrong\u003ebrand \u003c/strong\u003eand visual design and focused on:\u003c/p\u003e\u003cul\u003e\u003cli\u003eWhat makes a BuzzFeed product look and feel like BuzzFeed?\u003c/li\u003e\u003cli\u003eWhat is unique about BuzzFeed’s brand that we should strive to visually express in our products?\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eI used the “note and vote” brainstorm technique because it’s a great way to get everyone in the room to share their thoughts, no matter how introverted they may be. Each participant gets their own paper, pen, and a few minutes of silence to brainstorm and then edit. As facilitator, I then called on each person and asked them for their two top ideas and did some notetaking. After reading out the results, we then took turns selecting a favorite.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*sijNrRYTf77vbqiJjeSjBQ.jpeg\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FK1kzmELKCtTAMzG76L-UQ.jpeg\" /\u003e\u003cfigcaption\u003ebrainstorm output: 👈 ux / 👉 visual\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThese sessions were really enjoyable and enlightening. While we all had different interpretations during the \u003cem\u003enote\u003c/em\u003e portion, our \u003cem\u003evotes \u003c/em\u003eall gravitated toward the same general themes. That alignment put us in a great spot to take the next step in the process…!\u003c/p\u003e\u003ch4\u003eCreating pithy catchphrases\u003c/h4\u003e\u003cp\u003eNext up was a lot of editing! I chunked up the brainstorm output into some themes, and started elaborating on them:\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FW1JD0nx_z-8qPjbmD-xig.png\" /\u003e\u003cfigcaption\u003eAn early version of the docs!\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://medium.com/@tomharman\"\u003eTom\u003c/a\u003e and I took the early versions of my working doc to critiques and secretly did some test drives to see if they were useful. They seemed to be!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHowever, \u003c/strong\u003ewhile the principles worked in practice, we were still thinking of brand and user experience as two separate things (in two separate documents), when in practice a product is both of these together. Duh. Our intrepid VP,\u003ca href=\"https://medium.com/@cap\"\u003e Cap\u003c/a\u003e, wisely pointed this out and quickly course-corrected.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*sYCBqvJNkRQRxJMtkNFfQA.png\" /\u003e\u003cfigcaption\u003e6,592 revisions from October to December, according to Draftback\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAfter weeks of wordsmithing, I presented our proposed principles during a design offsite to get another round of feedback, as well as to our product management team to see if they resonated with them. And a few more tweaks for clarity later, here we are.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*proqjUc5r0BwrrjcXmll5Q.png\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*qqy5T7cS8T9do3Lb9LBL-w.png\" /\u003e\u003cfigcaption\u003eKeep it fresh / Pair simplicity with delight — Art by Celine Chang\u003c/figcaption\u003e\u003c/figure\u003e\u003ch4\u003eWhat now?\u003c/h4\u003e\u003cp\u003eA few members of the Product Design team are taking this as an opportunity to flex our graphic design muscles and design some artifacts to physically showcase our principles.\u003c/p\u003e\u003cp\u003eOn top of being eye candy, we’ll be hanging posters in the office, sticking them on laptops, and tucking them in notebooks as reminders of what we care about. The hope is that they give us language to ground our critiques and decisions in, but we fully recognize them as a work-in-progress and expect them to evolve over time as our team, our products and our needs grow and change. Some things we hope to see happen as we roll these out:\u003c/p\u003e\u003cul\u003e\u003cli\u003eIt’s easier for an individual product designer to pick between divergent design directions\u003c/li\u003e\u003cli\u003eOther members of our teams (product managers, engineers, etc.) have a shared language for giving feedback on Basecamp, Slack, or IRL\u003c/li\u003e\u003cli\u003eOutside of using shared components or styles, our design artifacts share a basic sensibility and \u003cem\u003efeel\u003c/em\u003e more consistent\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eHigh hopes, I know! We’ll see how these principles perform across the whole team in the coming months and, as with everything, learn, revisit and iterate.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GfqPDcR4qsxY9EOPmL6ErQ.png\" /\u003e\u003cfigcaption\u003eAdvocate for our users — Art by Celine Chang\u003c/figcaption\u003e\u003c/figure\u003e\u003ch4\u003eDo you think design principles might help your team?\u003c/h4\u003e\u003cp\u003eCheck out a few of the resources we referenced throughout the process:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"http://www.designprinciplesftw.com/\"\u003eDesign Principles FTW\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://medium.com/elegant-tools/facebook-s-four-business-design-principles-for-crafting-elegant-tools-581a7055dee8#.p8qzufi74 \"\u003eFacebook’s Four Business Design Principles for Crafting Elegant Tools\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.facebook.com/notes/facebook-design/facebook-design-principles/118951047792/\"\u003eFacebook Design Principles\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.gov.uk/design-principles\"\u003eGovernment Digital Service Design Principles\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://material.io/guidelines/\"\u003eMaterial Design\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://library.gv.com/note-and-vote-how-to-avoid-groupthink-in-meetings-24e829e43295\"\u003eNote-and-vote: How to avoid groupthink in meetings\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cem\u003eAnd of course, please reach out in the comments with questions or thoughts!\u003c/em\u003e\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=e7d99b74c46e\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/buzzfeeds-product-design-principles-e7d99b74c46e\"\u003eBuzzFeed’s Product Design Principles\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/buzzfeeds-product-design-principles-e7d99b74c46e?source=rss----60b3a6f3294f---4","published":"Tue, 06 Jun 2017 14:22:26 GMT","publishedParsed":"2017-06-06T14:22:26Z","author":{"name":"Caitlin Osbahr"},"guid":"https://medium.com/p/e7d99b74c46e","categories":["ux","buzzfeed","product-design"],"dcExt":{"creator":["Caitlin Osbahr"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2017-06-06T14:28:39.496Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Caitlin Osbahr","attrs":{},"children":{}}]}}},{"title":"Join the BuzzFeed Product Design team!","content":"\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*kwaCW9AktrKEEFx9RMGysQ.jpeg\" /\u003e\u003cfigcaption\u003e\u003ca href=\"https://www.instagram.com/p/BNzwGcbgwOw/\"\u003eOur team\u003c/a\u003e circa December 2016 minus \u003ca href=\"https://twitter.com/kisalow\"\u003eWolasi\u003c/a\u003e, \u003ca href=\"https://twitter.com/cayleebetts\"\u003eCaylee\u003c/a\u003e \u0026amp; \u003ca href=\"https://www.instagram.com/celchang/\"\u003eCeline\u003c/a\u003e 😢\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWe’re currently looking for rad Product Designers to help us define, design and build the future for our web site, native apps and suite of internal tools!\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eHow does BuzzFeed Product Design approach hiring?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eOur hiring process is optimized for speed and humanity. We, the product design team handle our own hiring, not HR or recruiting. This ensures your portfolio gets the attention it deserves and allows us to move quickly when we find a great candidate for an open role. Our hiring process is designed around mutual respect and transparency because we believe this is the best way to ensure a great fit for both sides of the table.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eWhat makes a good candidate?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWe opt for generalists, designers who can take a project from inception all the way through to implementation and everything in between. UX, visual design, prototyping and great communication are some of the skills we value, more detail can be found in our \u003ca href=\"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74\"\u003eroles doc\u003c/a\u003e. Everyone on our team is full-time and based onsite in NYC or LA, we find this to be more effective than working with freelancers or remote employees. Sometimes we meet fantastic product designers who just aren’t a good fit for how we work, or the timing doesn’t work out. We’re a small team so don’t have the luxury of hiring people into roles that don’t exist yet.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eHow big is the team and how is it structured?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWe are 14 people and growing! 10 individual contributors, 3 managers and a VP of Design. We operate using a hybrid model meaning designers are embedded (and sit with) their squads, but come together at least twice a week as a team for portfolio critiques and other team activities. BuzzFeed Tech’s senior management structure gives an equal seat to Design, Product, Engineering and Data Science, having each discipline report directly to our publisher.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eWhen reviewing portfolios, what do you look for?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWe typically spend a couple of minutes looking over each portfolio we receive, primarily looking at three areas:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eFinal output \u003c/strong\u003e— What was shipped? How clear are the flows? How polished are the screens? Is there a prototype or animation that highlights the details of the experience?\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eDesign process, concisely communicated \u003c/strong\u003e— What process did this project involve? Why tackle this problem in the first place? What artifacts (sketches, wireframes, prototypes etc) were created during the journey? What ideas were tried and discarded? How was the final solution arrived upon? Does the solution actually solve the problem it set out to achieve? Is this person an articulate written communicator? Is it easy to scan and get a quick sense of the work involved?\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRole on project \u003c/strong\u003e— What other disciplines collaborated on this project? Did they collaborate with other designers too? If so, what was their role specifically?\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eOur favorite portfolios tend to feature 3–4 focused case studies. We also like to see résumé’s (or LinkedIn profiles) although the portfolio is the most important part.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eDo you offer internships or hire associate designers?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eHistorically we’ve offered one internship in the summer. In many ways the standard we hold for interns is similar to what we hold for associate designers, reflected in IC1 in our \u003ca href=\"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74#.j9f4d3vno\"\u003eroles doc\u003c/a\u003e. We’re less interested in experience than we are in raw skill. We don’t expect interns to be great at every criteria, but strong core skills in visual design, UX, process and communication typically make candidates stand out most.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eWhat does the hiring process look like?\u003c/strong\u003e\u003c/h4\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eInitial chat (15–30 mins)\u003c/strong\u003e—A quick conversation with a design manager. We’ll tell you about the specific roles we have open, get to know a bit more about you and answer any questions you may have. This chat is pretty casual, and focused on identifying potential for a good fit.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003ePortfolio Review (45–60 mins)\u003c/strong\u003e—This is the part where we look through your work. We’d love to see 2–3 projects you’ve worked on in the past, from conception (how did it start) to launched product. While the finished product is important, it’s even more important to share the messiest parts of your process: what did you try that didn’t work? What variations did you come up with before narrowing down to the one you shipped? Which portions of the work generated friction or disagreement with your team or other stakeholders? Did you run experiments? If so, what did you learn?\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eTeamwork + Collaboration (45–60 mins)\u003c/strong\u003e—This chat focuses on softer skills such as collaboration, communication and the areas you’re looking to grow. Our goal is to learn how you work best and what your experience has been across the teams you’ve previously worked on. How do you like to handoff work to engineers? How did you resolve conflict on a recent project? What makes a great team? How does your ideal team collaborate together?\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eOutstanding Questions\u003c/strong\u003e—Following our initial conversations we often have areas we weren’t able to uncover in enough detail. We typically opt for a paid design exercise or a more focused portfolio review to resolve these outstanding questions before inviting someone on-site for an interview loop.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eOn-site loop (5 hours)\u003c/strong\u003e—This is the fun part! You join us on site and meet the people your role would work closest with. The first hour is a group portfolio review, where you’ll talk through a slide deck of a couple of recent projects (from inception to shipping to what you learned). It’s really important to show and talk about your process. This group session provides everyone the same context for the 1:1s that follow, these are 45 minute conversations you’ll have with the engineers, product managers and designers from the room, typically 4–6 people. Expect at least one interview to include a white boarding exercise and another to involve a lightweight html/css exercise to see how you learn and think through engineering problems.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eAnd that’s it. Interested?\u003c/p\u003e\u003cp\u003e\u003cem\u003eWe’ve filled all our open roles for 2017 but keep an eye on this Medium publication or \u003c/em\u003e\u003ca href=\"http://twitter.com/cap\"\u003e\u003cem\u003eCap\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003e\u003ca href=\"https://twitter.com/kelsa_\"\u003e\u003cem\u003eKelsey\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003e\u003ca href=\"https://twitter.com/cayleebetts\"\u003e\u003cem\u003eCaylee\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u0026amp; \u003c/em\u003e\u003ca href=\"https://twitter.com/tomharman\"\u003e\u003cem\u003eTom\u003c/em\u003e\u003c/a\u003e\u003cem\u003e for new opportunities as they arise.\u003c/em\u003e\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=433f9a5dc560\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/join-the-buzzfeed-product-design-team-433f9a5dc560\"\u003eJoin the BuzzFeed Product Design team!\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/join-the-buzzfeed-product-design-team-433f9a5dc560?source=rss----60b3a6f3294f---4","published":"Tue, 28 Mar 2017 14:29:37 GMT","publishedParsed":"2017-03-28T14:29:37Z","author":{"name":"Tom Harman"},"guid":"https://medium.com/p/433f9a5dc560","categories":["product-design","design","ux","portfolio","hiring"],"dcExt":{"creator":["Tom Harman"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2017-10-19T18:31:12.137Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Tom Harman","attrs":{},"children":{}}]}}},{"title":"Introducing BuzzFeed’s Design Process","content":"\u003cp\u003eThe word \u003cem\u003e“process”\u003c/em\u003e appears 44 times in \u003ca href=\"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74#.54xzf4ffw\"\u003eour roles doc\u003c/a\u003e — our reference for evaluating designers — and only increases its prevalence as a designer grows in seniority. So, why is having a unified process important? And, what does BuzzFeed’s design process look like? This post details the shiny new process we recently rolled out and how we’re aiming to increase the chance of our projects unfolding like the synchronized divers below.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/480/1*5rSrPiduxfKUYFpr_tcuMg.gif\" /\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/312/1*_gLKTbmnJtjoLBRR-Jo1wA.gif\" /\u003e\u003cfigcaption\u003e👈 when a project goes smoothly / 👉 when a project doesn’t go smoothly\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOur goal was not to enforce a new way of working, but to observe and codify what’s currently effective and create just enough structure to aid communication, clarity and transparency throughout the lifecycle of a project, both inside and outside of the design team.\u003c/p\u003e\u003cp\u003eA unified process provides a precise vocabulary and set of expectations to help all involved understand what’s happening and course correct early as a project unfolds — not waiting until there are polished visuals before questioning something more fundamental to the product.\u003c/p\u003e\u003cblockquote\u003eA strong design process establishes a shared vocabulary and sets clear expectations to course correct early and often\u003c/blockquote\u003e\u003cp\u003eThe process behind the process involved plenty of research ranging from user interviews with the team to looking at approaches used in product, consulting and academic contexts. Finding the sweet spot between each led us down the path of two complementary models, one provides a macro-view while the other focuses on the micro-view of a project. While each has its strengths it’s the combination of both that I’m really excited about and that I hope will be most effective at meeting our needs.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eThe Phases of Product Design\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003ePhases provide the macro-view of a design project with a focus on navigating time and clarifying expectations. Whatever stage they’re at designers should have a strong sense of what the remaining phases look like and be able to reflect on what phases they’ve been through so far, both for themselves but also to communicate with others on a project. Adapting quickly is important to how our organization functions so dealing with uncertainty is a reality we need to face. Due to this we choose an approach that highlights known knowns and known unknowns rather than forcing a designer through a specific sequence, or series of gates, ala the waterfall method.\u003c/p\u003e\u003cp\u003eThere are five phases in the BuzzFeed Product Design Process, which break down as follows:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eDefine\u003c/strong\u003e — Know the problem and uncover as many constraints as possible\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eExplore\u003c/strong\u003e — Generate as many solutions as possible while exploring the problem space\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRefine \u003c/strong\u003e— Validate which solutions work before distilling down the simplest design\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eBuild \u003c/strong\u003e— Translate this design into reality through code or specs\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eLearn \u003c/strong\u003e— Understand whether the design was successful and what needs further work\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThey unfold over time:\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DdDKvNqNTixQ07sE2WBZDg.png\" /\u003e\u003c/figure\u003e\u003cp\u003eA project doesn’t necessarily have to conform to a particular sequence but the goal of reaching Learn as quickly as possible provides a north-star and the flexibility to adapt as the realities of a project unfold after kick off. The scale on the x-axis is variable to fit any sized project, this works as well for a project lasting a week as it does for a 6-month marathon.\u003c/p\u003e\u003cp\u003eAnd here is a project showing a slightly more realistic sequence complete with the loops that each phase is made up of:\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*JXsiqDXg4nF8nGP1sa1zpw.gif\" /\u003e\u003cfigcaption\u003eNote the overlapping phases, out of order sequence and dates on the x-axis, all helping this technique scale to a variety of projects.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch4\u003e\u003cstrong\u003eThe Product Design Feedback Loop\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eThe loop provides the micro-view, it’s the atomic unit of our design process. While it also happens over time, time is much less relevant here, the focus is toward deconstructing something designers typically internalize as one fluid movement in order to pinpoint areas for clarity and growth. Think of a tennis coach deconstructing a serve, this is our toolkit for analyzing each component part and helping designers grow their capability across them.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zConK3Qqoc3CsCTAzMzEMw.png\" /\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eGather\u003c/strong\u003e input through observation, listening or research.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSynthesize\u003c/strong\u003e this input, identifying where you need to go next and what artifact will help get you there.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eMake\u003c/strong\u003e an artifact, using an appropriate tool and level of fidelity.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eCommunicate\u003c/strong\u003e the artifact you’ve made, through the right channel, to the appropriate audience, to gather further input.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eDigital product design is such a new discipline that most practitioners have learned through experience, but everyone has taken a different path and some work environments simply don’t require as much explicit communication or synthesis e.g. a solo designer without a team or manager. It’s not uncommon for inexperienced designers to jump to solutions before they’ve fully unpacked and understood a problem, or to fold in \u003cem\u003eall\u003c/em\u003e feedback they’ve received because “my peers are smart” without practicing the skill of filtering out input that’s distracting or not inline with the goals of a project. This model provides a shared language allowing others to offer precise feedback, helping a designer grow capabilities throughout the loop.\u003c/p\u003e\u003cp\u003eHere’s an example of three loops that could happen during an explore phase.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*9RGPc46tN6vZ4Ss04E0ycA.gif\" /\u003e\u003c/figure\u003e\u003cp\u003eAs you can see, this is less of a hard science and more of a tool to reveal blind spots. While this GIF explicitly mentions tools like Sketch, the framework is intended to be tool agnostic.\u003c/p\u003e\u003ch4\u003eWhat we’ve learned so far\u003c/h4\u003e\u003cp\u003eWe rolled this out to the designers in May and the wider tech team July. It’s still early but initial signs are promising, here are a few highlights:\u003c/p\u003e\u003cul\u003e\u003cli\u003eOur weekly crit reminder email now includes the phase each project we’re critiquing is in, helping increase the chance of delivering—and receiving—the most timely and actionable feedback.\u003c/li\u003e\u003cli\u003eWhen a designer starts to churn on their work, the loop and phases have provided a useful tool for others to nudge them back on track. I’ve also noticed designers recognizing this for themselves, and re-calibrating their approach when enough consensus has been reached.\u003c/li\u003e\u003cli\u003eDebriefing after crits has become more actionable with the loop, helping designers synthesize which input to take on board and identifying which type of artifact will be most useful to make next.\u003c/li\u003e\u003cli\u003eSetting soft-skill goals and giving feedback during 1:1s has become clearer with a shared understanding of the loop. Synthesis and communication are often the largest opportunities for improvement—especially in less experienced designers—so having a shared language to discuss this through with them has resulted in significant progress in these areas across the board.\u003c/li\u003e\u003cli\u003eI couldn’t publish this post without showing the scenes that unfolded in the office after we rolled this out. ❤️❤️❤️\u003c/li\u003e\u003c/ul\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*24T08UxcyVjsCDfFA4UgGg.jpeg\" /\u003e\u003cfigcaption\u003e👈 \u003ca href=\"https://twitter.com/oiyana\"\u003eJac\u003c/a\u003e prefers to make her own banner ads / 👉 \u003ca href=\"https://twitter.com/allisonchefec\"\u003eAllison\u003c/a\u003e likes to keep humanity at the core of her process\u003c/figcaption\u003e\u003c/figure\u003e\u003ch4\u003eNext Steps\u003c/h4\u003e\u003cp\u003eThis hasn’t been a radical shift, it’s a progressive enhancement. While we expect our process will evolve it’s important to have a line in the sand to move forward from, and this first version marks that moment.\u003c/p\u003e\u003cp\u003eProcess is often unique to the organization it functions inside. While our approach might be less relevant to your team, I hope you found something valuable here. At worst, it doesn’t prove useful, at best it provides a whole new way to collaborate and ultimately raise the bar for product design in your team.\u003c/p\u003e\u003cp\u003e\u003cem\u003eFeel free to take what’s valuable and iterate on what’s missing. I’d love to hear how you get on so why not ping me \u003c/em\u003e\u003ca href=\"http://twitter.com/tomharman\"\u003e\u003cem\u003e@tomharman\u003c/em\u003e\u003c/a\u003e\u003cem\u003e to let me know which pieces have proven effective for you?\u003c/em\u003e\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=4fefbdcd83ea\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/introducing-buzzfeeds-design-process-4fefbdcd83ea\"\u003eIntroducing BuzzFeed’s Design Process\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/introducing-buzzfeeds-design-process-4fefbdcd83ea?source=rss----60b3a6f3294f---4","published":"Wed, 03 Aug 2016 21:02:47 GMT","publishedParsed":"2016-08-03T21:02:47Z","author":{"name":"Tom Harman"},"guid":"https://medium.com/p/4fefbdcd83ea","categories":["management","design","team","design-process","ux"],"dcExt":{"creator":["Tom Harman"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2016-08-03T22:54:20.103Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Tom Harman","attrs":{},"children":{}}]}}},{"title":"Design Tooling With Solid \u0026 Atom (or, making the IDE our BFF)","content":"\u003cstyle\u003ebody[data-twttr-rendered=\"true\"] {background-color: transparent;}.twitter-tweet {margin: auto !important;}\u003c/style\u003e\u003cblockquote class=\"twitter-tweet\" data-conversation=\"none\" data-align=\"center\" data-dnt=\"true\"\u003e\u003cp\u003epic.twitter.com/voRzvFOBBu\u003c/p\u003e\u003cp\u003e\u0026#x200a;\u0026mdash;\u0026#x200a;\u003ca href=\"https://twitter.com/TedGoas/status/718091307860803585\"\u003e@TedGoas\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cscript src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e\u003cscript\u003efunction notifyResize(height) {height = height ? height : document.documentElement.offsetHeight; var resized = false; if (window.donkey \u0026\u0026 donkey.resize) {donkey.resize(height); resized = true;}if (parent \u0026\u0026 parent._resizeIframe) {var obj = {iframe: window.frameElement, height: height}; parent._resizeIframe(obj); resized = true;}if (window.location \u0026\u0026 window.location.hash === \"#amp=1\" \u0026\u0026 window.parent \u0026\u0026 window.parent.postMessage) {window.parent.postMessage({sentinel: \"amp\", type: \"embed-size\", height: height}, \"*\");}if (window.webkit \u0026\u0026 window.webkit.messageHandlers \u0026\u0026 window.webkit.messageHandlers.resize) {window.webkit.messageHandlers.resize.postMessage(height); resized = true;}return resized;}twttr.events.bind('rendered', function (event) {notifyResize();}); twttr.events.bind('resize', function (event) {notifyResize();});\u003c/script\u003e\u003cscript\u003eif (parent \u0026\u0026 parent._resizeIframe) {var maxWidth = parseInt(window.frameElement.getAttribute(\"width\")); if ( 500  \u003c maxWidth) {window.frameElement.setAttribute(\"width\", \"500\");}}\u003c/script\u003e\u003cp\u003eNow that the debate over whether designers should code is settled, we should all move on to solving more important problems.\u003c/p\u003e\u003cp\u003eWe can finally begin to ask, \u003cstrong\u003e“How should designers code?”\u003c/strong\u003e BuzzFeed has some really great opinions on that topic, which is \u003ca href=\"https://medium.com/buzzfeed-design/introducing-solid-1c16b1bf4868\"\u003ewhy we built Solid as our foundational CSS framework\u003c/a\u003e.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/499/1*-vSU2nzmNmRHSf_2FxsvOA.gif\" /\u003e\u003cfigcaption\u003eMe using Atom editor\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eEmpowering designers with the means to code requires them to adopt development tools. Obviously, most development tools are built for engineers, but when designers code, \u003cstrong\u003ecoding tools are necessarily design tools\u003c/strong\u003e and become fundamental to designers’ process. That ultimately means that the text editor or IDE (Integrated Development Environment) becomes central to that workflow.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIt’s about time we treat the IDE as a design tool\u003c/strong\u003e and begin to use it in ways that fit our processes as designers.\u003c/p\u003e\u003ch4\u003eThe Problem With Solid\u003c/h4\u003e\u003cp\u003eSolid is too perfect. As an \u003ca href=\"https://medium.com/buzzfeed-design/how-i-learned-to-stop-worrying-and-love-the-atomic-class-98d6ccc45781\"\u003eOOCSS atomic framework\u003c/a\u003e, Solid is too good at doing what it is supposed to do. It has a plethora of prefixed classes that can get very messy to write and exceedingly difficult to remember. This is why the Solid team has invested so much time producing \u003ca href=\"http://solid.buzzfeed.com\"\u003ehuman-readable documentation\u003c/a\u003e for all the features included in the framework. Obviously, as the framework grows, so does the documentation and the reliance on that documentation. Designers that are less confident in their coding ability become overwhelmed at the sprawling complexity of implementing responsive-prefixed OOCSS classes. Developers used to a legacy HTML/CSS workflow find themselves buried under piles of documentation.\u003c/p\u003e\u003ch3\u003eGetting Friendly With Your IDE\u003c/h3\u003e\u003cp\u003eOne way of getting at this problem from both ends of the designer/developer spectrum is to employ your IDE. This way \u003cstrong\u003ewe can try to help designers solve for systemic complexity while also helping developers establish mental models\u003c/strong\u003e of how Solid should work.\u003c/p\u003e\u003ch4\u003eMaybe you have strong feelings for your IDE\u003c/h4\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*L3hUI0-0nYprhldx4e2tgA.png\" /\u003e\u003c/figure\u003e\u003cp\u003eOr, maybe you just use whatever is popular in your circle of designers or developers (many of us at BuzzFeed use SublimeText). I’m going to do something radical and suggest you try out \u003ca href=\"http://atom.io\"\u003eAtom\u003c/a\u003e.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/600/1*YGUcDhPxmR-Wk_FTCLeB2A.jpeg\" /\u003e\u003c/figure\u003e\u003cblockquote\u003e“Atom is a text editor that’s modern, approachable, yet hackable to the core — a tool you can customize to do anything but also use productively without ever touching a config file.” -The people at GitHub who made Atom\u003c/blockquote\u003e\u003cp\u003eMy goal isn’t really to sell you on Atom, but using Atom as an IDE does open up a really big world of design tooling that was inaccessible to most people before now. I should also mention that It’s completely free, cross-platform, has a super simple plugin package manager, and is built on Node.js and Chromium. What you sacrifice for the marginal slowness of running your IDE on a quasi-JavaScript engine, you gain in the ability to script your coding interface in HTML, CSS, and JavaScript.\u003c/p\u003e\u003ch3\u003eAutoComplete Joins Your Squad\u003c/h3\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*qbDPrIfKJXU0ne2XNL5CiA.gif\" /\u003e\u003c/figure\u003e\u003cp\u003eAtom’s AutoComplete framework is lightyears beyond what other IDEs offer. By ever-so-gently smashing Solid’s CSS classes and variables into an autocomplete plugin,\u003cstrong\u003e we are able to provide an instant way of recalling responsive classes and variable\u003c/strong\u003es, while providing quick context and links to relevant documentation right in your IDE.\u003c/p\u003e\u003cp\u003eCheck it out at \u003ca href=\"https://atom.io/packages/solid-completions\"\u003ehttps://atom.io/packages/solid-completions\u003c/a\u003e and install it directly into your Atom editor using the integrated package manager.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/640/1*DOL7sWmj769rF7_WRqxL0w.png\" /\u003e\u003c/figure\u003e\u003cp\u003eThe solid-completions plugin will autocomplete any classname in HTML-ish documents (including Mustache, Handlebars, etc) and will provide you with easy access to Sass variables in Sass/SCSS files. Just begin typing any part of the classname you would like to use and autocomplete will tell you what kind of Solid class it is and link you directly to the relevant documentation should you need more context.\u003c/p\u003e\u003ch3\u003eGetting Friendly With Your Framework\u003c/h3\u003e\u003cp\u003eMaybe you don’t want to use Solid, or maybe you have a favorite framework that you think can benefit from tight integration with your IDE. So, let’s get a little technical and talk about our general approach for creating an AutoComplete provider in Atom. Unfortunately, getting Solid into an autocomplete “provider” isn’t necessarily trivial, so here’s a few things that I did to make it easier along the way. I’m not going to go into too much detail here, but feel free poke around and clone the repo at \u003ca href=\"https://github.com/buzzfeed/solid-completions\"\u003egithub.com/buzzfeed/solid-completions\u003c/a\u003e to help make your own autocomplete provider based on your frameworks and preferences. If you’re still scratching your head, don’t hesitate to \u003ca href=\"http://twitter.com/mshuster\"\u003eget in touch\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFirst, I’d recommend getting a little more familiar with the \u003ca href=\"https://github.com/atom/autocomplete-plus/wiki/Provider-API\"\u003eAtom autocomplete provider API docs on GitHub\u003c/a\u003e. You’ll notice that Atom plugins are written in \u003ca href=\"http://coffeescript.org/\"\u003eCoffeeScript\u003c/a\u003e. CoffeeScript compiles to JavaScript, so it’s totally acceptable to write plugins in JavaScript if it’s more your speed.\u003c/p\u003e\u003cp\u003eThen you’ll need to structure the data that you want your provider to serve. We did this by analyzing our SCSS and CSS files with \u003ca href=\"https://github.com/postcss/postcss\"\u003ePostCSS\u003c/a\u003e. PostCSS is a stylesheet post-processor that’s commonly used to manipulate CSS after it has already passed through preprocessors like Sass and has been rendered into CSS. It’s incredibly powerful, but we like it because it constructs a walkable AST (abstract syntax tree) in JSON that you can use to extract all the rules in your CSS or Sass that you would like to serve as autocomplete phrases.\u003c/p\u003e\u003cp\u003eYou’ll then have to define the scope to determine when the autocomplete provider will be serving suggestions to the user. For classes in an HTML document, your scope would look something like:\u003c/p\u003e\u003cpre\u003e.html .meta.tag.any .string.quoted\u003c/pre\u003e\u003cp\u003eHowever, be aware that this will trigger autocomplete on any attribute that has a value in quotes. To make sure you’re only triggering on class attributes, you’ll have to take a look at the current line your editor buffer and walk back to the nearest attribute.\u003c/p\u003e\u003cp\u003eFinally, when you build your array of suggestions, make use of the various properties in the suggestion object to include hints to the user about what the keyword does and how to use it. Our solution shows the Solid framework logo, along with a label indicating what the function of the class does. We also include a link to the relevant documentation for that class within the description field.\u003c/p\u003e\u003ch3\u003eGet Friendly With Your Fellow Designers and Developers\u003c/h3\u003e\u003cp\u003eDesigning in code means one less level of abstraction for passing design artifacts between “designers” and “developers.” Having both sides of the spectrum work with the same tools creates many efficiencies, but \u003cstrong\u003ethere is also a big opportunity to build our own processes and workflows into extensible tools like Atom\u003c/strong\u003e to allow for even greater learning, cooperation, and standardization.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*d3TKqTryuYpNCh5MIQ3PEg.gif\" /\u003e\u003c/figure\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=d2b0035cf62d\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/design-tooling-with-solid-atom-or-making-the-ide-our-bff-d2b0035cf62d\"\u003eDesign Tooling With Solid \u0026amp; Atom (or, making the IDE our BFF)\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/design-tooling-with-solid-atom-or-making-the-ide-our-bff-d2b0035cf62d?source=rss----60b3a6f3294f---4","published":"Tue, 19 Apr 2016 15:00:15 GMT","publishedParsed":"2016-04-19T15:00:15Z","author":{"name":"Mark Shuster"},"guid":"https://medium.com/p/d2b0035cf62d","categories":["buzzfeed","atom","design"],"dcExt":{"creator":["Mark Shuster"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2016-04-19T15:35:15.701Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Mark Shuster","attrs":{},"children":{}}]}}},{"title":"BuzzFeed Product Design Roles 2.0","content":"\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*6NLdG6B7L-rCGXwySgaILA.gif\" /\u003e\u003cfigcaption\u003ePhoto by \u003ca href=\"https://www.stocksy.com/34135\"\u003eDeirdre Malfatto\u003c/a\u003e; illustration by \u003ca href=\"http://www.buzzfeed.com/shaunpendy\"\u003eShaun Pendergast/BuzzFeed\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIn spring of 2015, I \u003ca href=\"https://medium.com/@niederme/a-farewell-to-the-times-32013afef8cc#.6p3hs4gip\"\u003eleft a job I loved\u003c/a\u003e to become a design manager at BuzzFeed, excited to tackle new challenges in a new organization. Having spent more than seven years in one place, it was naturally a bittersweet time. Reflecting back on my career, I felt grateful for the people that provided me opportunities and guided me through fifteen years of professional development. But despite this luck, there were times when it wasn’t clear what I needed to do in order to grow or level up, and sometimes I felt frustration that my bosses didn’t value my contributions as much as the people I worked with did.\u003c/p\u003e\u003cp\u003eThis is a natural feeling, especially early in a designer’s career. But as managers, we can provide a framework to ensure folks know whether or not they’re doing a good job, and what they need to do to move forward in their careers.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eA year of learning\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eWhen Cap joined BuzzFeed as its first V.P. of Design at the start of 2015, he quickly put into place some \u003ca href=\"http://blog.capwatkins.com/scaling-design\"\u003estructures and processes\u003c/a\u003e that had served well in his previous role at Etsy. Weekly design crits were set up, a Basecamp team created to facilitate discussion and feedback loops, and he wrote a first pass at a \u003ca href=\"https://docs.google.com/document/d/1BFxOdxTzSlSy-IxNeg0u3q8hLcJ1TDkskvvUtyarlm8/\"\u003eroles and responsibilities document\u003c/a\u003e for the designers and design managers.\u003c/p\u003e\u003cp\u003eBy Cap’s own admission, this roles doc was merely a starting point — better than nothing—but not as clear and actionable as it could be, especially for the needs of a growing team. By the end of the year, some questions and confusion started to surface: were there clear bars set for each role? Did every designer and their manager understand how to meet that bar? Was it clear how to work towards the next level?\u003c/p\u003e\u003cp\u003eOne year in, we were due for some reassessment.\u003c/p\u003e\u003ch4\u003e‘Re-anchoring’ and Roles 2.0\u003c/h4\u003e\u003cp\u003eIn January, the design managers and a few designers from the team met off-site to discuss our processes and assumptions, in a process called \u003ca href=\"http://blog.capwatkins.com/the-great-reanchoring\"\u003eRe-anchoring\u003c/a\u003e. One of the things confirmed in this discussion was that the roles document \u003cem\u003ewas\u003c/em\u003e too vague, and that designers didn’t have a clear understanding of how to level-up. And as managers, we didn’t always set a consistent bar across the team, especially for Sr. Designers.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*mzFCGEDrrurCE2AgGHL6Jw.jpeg\" /\u003e\u003cfigcaption\u003e(Most) of the Product Design team, March 2016\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSo, in rewriting the Roles, our approach was to:\u003c/p\u003e\u003cul\u003e\u003cli\u003eSet clear bars for each level, that designers and managers can work towards.\u003c/li\u003e\u003cli\u003eCluster responsibilities thematically, around areas of focus: \u003cem\u003eVisual Design, Brand, Patterns, UX Design, Process, Toolkit, Transparency, Experiments, Fluency, Writing, Mentorship \u003c/em\u003eand\u003cem\u003e Culture.\u003c/em\u003e\u003c/li\u003e\u003cli\u003eFirst define the most senior role (Staff Designer – IC4), and then “back out” responsibilities each level down.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe result is a far more clear, actionable and scalable framework for designers and managers, and we’ve already used it to set individual Q2 goals. We’d love to share it with you:\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://docs.google.com/document/d/1V8HHMXe2LIj4V6SfnxXm-3FCDkZP0U7lLt9dvtjNrHk/edit?usp=sharing\"\u003eBuzzFeed Product Design Roles 2.0 »\u003c/a\u003e\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eFeel free to take this, fork it and evolve it for your organization! \u003c/strong\u003eWe’d love to hear how it goes, and send along any questions or other feedback.\u003c/p\u003e\u003cp\u003eWe’ve been posting process docs \u003ca href=\"https://twitter.com/cap/status/668817021639876608\"\u003elike this\u003c/a\u003e as we go, because we believe it’s important (and helpful for us) to share with the community. And we’ll probably evolve it as our team’s needs evolve!\u003c/p\u003e\u003cp\u003e\u003cem\u003eWhy not follow \u003c/em\u003e\u003ca href=\"https://twitter.com/buzzfeedproduct/\"\u003e\u003cem\u003e@buzzfeedproduct\u003c/em\u003e\u003c/a\u003e\u003cem\u003e and \u003c/em\u003e\u003ca href=\"https://twitter.com/niederme/\"\u003e\u003cem\u003e@niederme\u003c/em\u003e\u003c/a\u003e\u003cem\u003e on Twitter? \u003c/em\u003e🙌\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=6fe445078a74\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74\"\u003eBuzzFeed Product Design Roles 2.0\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/buzzfeed-product-design-roles-2-0-6fe445078a74?source=rss----60b3a6f3294f---4","published":"Fri, 15 Apr 2016 15:01:02 GMT","publishedParsed":"2016-04-15T15:01:02Z","author":{"name":"John Niedermeyer"},"guid":"https://medium.com/p/6fe445078a74","categories":["design","management","career-development","product-design","buzzfeed"],"dcExt":{"creator":["John Niedermeyer"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2016-10-12T18:02:27.761Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"John Niedermeyer","attrs":{},"children":{}}]}}},{"title":"How I Learned to Stop Worrying and Love the Atomic Class","content":"\u003cp\u003eThe first conversation I had with Cap about using atomic classes at BuzzFeed went something like this:\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/359/1*Hg2R4S629LYkvLsrhjdEFQ.gif\" /\u003e\u003c/figure\u003e\u003cblockquote\u003eCap: Check out \u003ca href=\"http://www.basscss.com/\"\u003ebasscss\u003c/a\u003e. It’s a class library that lets you build new UI elements quickly.\u003c/blockquote\u003e\u003cblockquote\u003eSam: I hate it!\u003c/blockquote\u003e\u003cp\u003e\u003ca href=\"http://www.basscss.com/\"\u003eBasscss\u003c/a\u003e is an atomic class based CSS library created by Brent Jackson. A very good one! But I really hated it at the time. But I don’t hate it anymore! Atomic classes are the backbone of \u003ca href=\"http://solid.buzzfeed.com/\"\u003eSolid\u003c/a\u003e, BuzzFeed’s CSS styleguide. With my blessing.\u003c/p\u003e\u003cp\u003eHow did that happen? Well I took a journey of self-discovery. Along the way I learned that an atomic class system can be a rad tool in your design/development arsenal. If you use it right. Take my hand and I’ll lead you there. We’ll learn a lot along the way. And, if we’re lucky, have a few laughs ;)\u003c/p\u003e\u003ch4\u003eWhat Are Atomic Classes?\u003c/h4\u003e\u003cp\u003eAtomic classes are tiny, single-use CSS classes that you can combine to style HTML elements. For example in Solid the class “.xs-p1” will give you one unit of padding. Atomic class libraries give you a suite of these classes. You can combine them to tweak elements or style them from the ground up. Here is an example of an element styled with Solid’s atomic classes:\u003c/p\u003e\u003cpre\u003e\u0026lt;div class=”xs-border xs-p1\u0026quot;\u0026gt;10 top thought leaders\u0026lt;/div\u0026gt;\u003c/pre\u003e\u003cp\u003eWhen I first saw a string of code like that it terrified me. I believed we should write CSS classes that describe their context rather than what they look like. I believed that well-written HTML will let you totally change a site’s visual style by\u003ca href=\"http://www.csszengarden.com/\"\u003e switching up its CSS\u003c/a\u003e. Here is that same element with a semantic class name:\u003c/p\u003e\u003cpre\u003e\u0026lt;div class=”subheader”\u0026gt;10 top thought leaders\u0026lt;/div\u0026gt;\u003c/pre\u003e\u003cp\u003ePlus the following CSS, in a CSS file somewhere.\u003c/p\u003e\u003cpre\u003e.subheader {\u003cbr\u003e  border: 1px solid rgba(0, 0, 0, .2);\u003cbr\u003e  padding: .5rem;\u003cbr\u003e}\u003c/pre\u003e\u003cp\u003eI feared deviating from these nicely named CSS classes would open the door to total DOM chaos: swaths of tiny classes in massive template files. Fire. Brimstone. I researched every \u003ca href=\"https://www.smashingmagazine.com/2013/10/challenging-css-best-practices-atomic-approach/\"\u003epoint\u003c/a\u003e and \u003ca href=\"http://csswizardry.com/2015/03/can-css-be-too-modular/\"\u003ecounterpoint\u003c/a\u003e I could find on atomic class systems. I even made 30 minute powerpoint presentation titled “Systemic Vs Atomic Class systems.” It was so dry it nearly mummified the team.\u003c/p\u003e\u003cp\u003eAfter much research and tinkering I realized that we shouldn’t choose the CSS framework that was more ideologically “correct.” We should choose what is correct for BuzzFeed. So the Solid team picked apart BuzzFeed’s needs and goals and developed a CSS framework that works for our team. One that uses atomic classes!\u003c/p\u003e\u003ch4\u003eWhy Atomic Classes Work for BuzzFeed\u003c/h4\u003e\u003cp\u003eThe indisputable greatest strength of an Atomic-class-based system is it allows you to construct new, responsive UI quickly with no additional CSS. It is Ultra Dry™. Its greatest weakness is it makes the DOM very difficult to read.\u003c/p\u003e\u003cp\u003eIn order to understand why this tradeoff can be worth it you need to download Solid and, as a designer, start building UI. As a developer the ability to choose how many units of padding a container has feels like a burden. But as a designer being able to rapidly tweak and deliver finished UI is incredible. You can use the DOM as a design tool.\u003c/p\u003e\u003cp\u003eAt BuzzFeed we are designing new UI all the time, across projects. We cannot definitively say that BuzzFeed’s UI is built on a foundational `box` element. But we can define what our border colors and padding units will be and give our designers the autonomy to take it from there.\u003c/p\u003e\u003cp\u003eAutonomy is the key word here. Previous style guides I’ve worked on have been super rigid. Here is an element, don’t mess around with it. Solid is not like that. It’s a toolkit. We’re assuming anyone using Solid has the sense to make both strong design and markup decisions. We back that up by training our design team in HTML and CSS best practices, involving them in code reviews, and pairing them with developers.\u003c/p\u003e\u003cp\u003eNow we have designers writing production ready templates across projects, using a single framework, with no CSS bloat. Thanks, atomic classes :’)\u003c/p\u003e\u003ch4\u003eSam’s Golden Top 4 Very Special Rules For Using Solid’s Atomic Classes!\u003c/h4\u003e\u003cp\u003eIf you’re not careful with atomic classes you can make your HTML illegible and tie style to content in murky ways. To prevent that follow these rules.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eAtomic classes can only be overwritten by other atomic classes.\u003c/strong\u003e \u003cbr\u003eIf you can’t trust that an atomic class’s style is applying the whole system is worthless.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eAtomic classes can never be added or modified by JavaScript.\u003cbr\u003e\u003c/strong\u003eYou should be able to add/remove classes without breaking functionality.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eName your template files well \u0026amp; add descriptive comments.\u003cbr\u003e\u003c/strong\u003eTo compensate for all of these small style-based classes.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIf you are fighting against Solid classes take a deep breath and rethink your approach.\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003cp\u003ePrint these rules out on the brightest color paper you have, glue them to a cereal box, and leave it on your desk for reference.\u003c/p\u003e\u003ch4\u003eWhat a Team Wants, What a Team Needs\u003c/h4\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*hxioDCkLsj6VDN65mV7nUg.gif\" /\u003e\u003cfigcaption\u003e\u003cem\u003ethis is the laugh I promised!\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eI’m not saying you should drop what you’re doing and follow our approach; the CSS framework you choose should depend on the needs of your team. If you want a rigid system of elements with little style variation you might want to make a component library from scratch. If you don’t need to control the visual style of your app try \u003ca href=\"http://getbootstrap.com/\"\u003ebootstrap\u003c/a\u003e/\u003ca href=\"http://foundation.zurb.com/\"\u003efoundation\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWe needed a front end toolkit that lets us design/build new UI quickly. We rolled our own, and now we use it all the time. And you can too! \u003ca href=\"http://solid.buzzfeed.com/\"\u003eDownload Solid\u003c/a\u003e, make something with it, and let us know what you think. You might want to build something similar. And remember: \u003ca href=\"https://www.youtube.com/watch?v=eAfyFTzZDMM\"\u003eyou are beautiful\u003c/a\u003e, no matter what they say.\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=98d6ccc45781\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/how-i-learned-to-stop-worrying-and-love-the-atomic-class-98d6ccc45781\"\u003eHow I Learned to Stop Worrying and Love the Atomic Class\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/how-i-learned-to-stop-worrying-and-love-the-atomic-class-98d6ccc45781?source=rss----60b3a6f3294f---4","published":"Wed, 03 Feb 2016 15:33:13 GMT","publishedParsed":"2016-02-03T15:33:13Z","author":{"name":"Sam Thurman"},"guid":"https://medium.com/p/98d6ccc45781","categories":["web-development","css","buzzfeed"],"dcExt":{"creator":["Sam Thurman"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2016-02-03T15:35:04.516Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Sam Thurman","attrs":{},"children":{}}]}}},{"title":"Building Solid","content":"\u003cp\u003eAs Emily noted in her \u003ca href=\"https://medium.com/buzzfeed-design/introducing-solid-1c16b1bf4868\"\u003epost introducing Solid\u003c/a\u003e, the team building our framework was a mix of designers and front-end developers. Prior to that, we had unintentionally built silos around the two disciplines. While we’re definitely proud of the end result, this new way of working came with some interesting challenges and lessons along the way. We know there are a lot of teams out there who are curious about bringing their engineers and designers closer together, so we thought we’d share a bit about what we encountered and what we’ve come away with after nearly a year of working closely together.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/400/1*DK3uHrwzhmVnlh2R0D731Q.gif\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/power-rangers-break-teamwork-5Ymi5wNuK6cne\"\u003ehttp://giphy.com/gifs/power-rangers-break-teamwork-5Ymi5wNuK6cne\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eProcess Rules\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWhen we started the project, we were pretty stoked about the idea. We were finally going to have a style guide! CSS would finally be simpler to work with! With all our excitement, it would have been pretty easy to just start building things without much regard for process or how we’d work together. We needed some sort of process to help us align our team and avoid a messy codebase. However, we also recognized that adding too much process too early can snuff out the energy and momentum before you’ve gotten anywhere. If we were going to be successful, we needed just the right amount of process and just the right amount of freedom.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/495/0*XdE7Y332-FhZujgK.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"https://media.giphy.com/media/gZEBpuOkPuydi/giphy.gif\"\u003ehttps://media.giphy.com/media/gZEBpuOkPuydi/giphy.gif\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eTo start, we decided to meet weekly, giving us a way to maintain momentum and have a regular forum for in-person discussion. After a few philosophical discussions in person and on Slack about how to structure our style guide and write the CSS (we had a \u003cem\u003elot\u003c/em\u003e of philosophical discussions throughout this process), we drew up an initial list of the elements we thought we might need. From there, we tackled one or two UI pieces at a time, starting with inventories of current implementations and new design explorations before moving on to actually writing them into the Solid codebase.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/660/0*rmaZ6HP4BXUVZxG-.\" /\u003e\u003cfigcaption\u003e\u003cem\u003eWe sort of had a lot of button styles…\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eCollaboration Is Key\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor each UI element inventory and explanation, we asked everyone to weigh in on the best, consistent solution. We used Basecamp (a staple on the design team) to share our work and explorations regularly and solicit feedback from across the entire product team. Even though the style guide group itself was small, we wanted to craft the core BuzzFeed styles with as many perspectives as possible. After all, these styles were going to belong to all of us.\u003c/p\u003e\u003cp\u003eThough a couple of our designers were already strong front-ends, we also decided to pair engineers with designers who had less front-end experience to write Solid’s code. Surely it wasn’t the fastest route, but it ensured a more well-rounded style guide team, taught designers how to write front-end and began to break down those old barriers between design and engineering.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/250/0*DgLLpKYfLu5el0mW.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/13zTeMM9tzvNL2\"\u003ehttp://giphy.com/gifs/13zTeMM9tzvNL2\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eBuild, Break, Change\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOnce we’d implemented our first couple UI elements, things began moving pretty quickly. Soon enough we had a somewhat working style guide that we could actually build things with! And, of course, the Solid team immediately started building small prototypes with our shiny new CSS. We didn’t have to focus on crafting the perfect button any longer. Now we could focus on more important problems like user experience and information architecture. We were thrilled to be able to easily demonstrate an idea with code, whereas before most of us had been living in a world of static mocks.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/426/0*dIPIHaxxmD9pl4O2.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/happy-excited-the-office-nGzeO4uSxRUcg\"\u003ehttp://giphy.com/gifs/happy-excited-the-office-nGzeO4uSxRUcg\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAs we started to share these prototypes as part of our normal design process, other designers wanted in too. We knew that the sooner we got people using it in their work, the sooner we’d discover things we missed, things we could kill, and what documentation was unclear. So, the Solid team helped designers get the local environment running on their machines. We used our public Slack channel as a way to answer questions from those using it and as a venue for collecting feedback. It soon became clear we needed a way to track issues, so we started to use Jira to manage our tasks and bugs. Things were really happening!\u003c/p\u003e\u003cp\u003eAfter using it ourselves and receiving feedback from the designers testing it, it became clear what was great and what needed more work. Our small team was able to iterate quickly. We changed class names when we realized they were confusing; we reorganized the navigation when it was hard to find things. And because our changes only impacted some small design prototypes, it was fairly painless to make sweeping changes when we realized we’d gone down the wrong path. Now, even though Solid is far more stable and being used in quite a few production environments at BuzzFeed, we still continue to evolve the code and documentation, knowing that as our needs change, our style guide has to change with it.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/0*mewRnjL3_gtifmCM.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/what-university-research-eXO8X3Oz90jPG\"\u003ehttp://giphy.com/gifs/what-university-research-eXO8X3Oz90jPG\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eCompromises can make or break your team\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThroughout the entire process, it wasn’t all rainbows and pumpkin spice lattes. To be honest, we’d regularly find ourselves in various disagreements. For instance, we didn’t always agree on how to structure the CSS. Should we use BEM or not? We discussed this issue countless times, and it’s something we are still struggling with today. We were all passionate and opinionated (and still are!), but we listened to each other and tried to arrive at most sensible product decision. We stayed focused by making the decision that made the most sense for us at the time. If we didn’t have a use case for it yet, we didn’t worry about it. We knew we’d cross that bridge when we got there.\u003c/p\u003e\u003cp\u003eCompromising isn’t always easy, but when you’re a small team working towards a single goal, you have to make it happen.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/320/0*0GZEvNMivfPxqWNA.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/dog-friends-teamwork-CsYE5uho41ysU\"\u003ehttp://giphy.com/gifs/dog-friends-teamwork-CsYE5uho41ysU\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eEarly communication means no surprises.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePeople don’t like secrets, especially when it comes to building something everyone is expected to use in their work on a daily basis.\u003c/p\u003e\u003cfigure\u003e\u003cimg alt=\"\" src=\"https://cdn-images-1.medium.com/max/160/0*00vMNZh781Ddcw9W.\" /\u003e\u003cfigcaption\u003e\u003ca href=\"http://giphy.com/gifs/new-girl-jake-johnson-nick-miller-VqPpOjb1rOBBS\"\u003ehttp://giphy.com/gifs/new-girl-jake-johnson-nick-miller-VqPpOjb1rOBBS\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFrom the beginning, we had two goals when it came to communication:\u003c/p\u003e\u003col\u003e\u003cli\u003eKeep the team small and the communication tight so we’d be able to move quickly.\u003c/li\u003e\u003cli\u003eBe transparent about our process, the project, and the expected outcome of it all.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eWe knew we had to work in a small, nimble team to be able to build the style guide quickly. We didn’t necessarily want all of the questions thrown at us from the beginning because we didn’t know the answers ourselves. We were figuring it out as it happened. At the same time, we weren’t secretive about the project or the process. Our public Slack channel was open to the entire team, where we were happy to answer any questions we \u003cem\u003ecould \u003c/em\u003eanswer as well as take suggestions.\u003c/p\u003e\u003cp\u003eOur early adopters were spreading excitement about Solid throughout the organization, but there were two other key events that helped us get the buy-in we needed to push Solid towards production. First, we gave a talk to the entire Tech team during our weekly Tech Talks series. We talked about why we thought Solid was important, how it was built and gave a quick demo of building a piece of UI with the framework. People were wowed and it felt really good to see the entire organization start to get excited.\u003c/p\u003e\u003cp\u003eAbout a month later, we held our first annual BuzzFeed Hack Week. We asked people to use Solid in their Hack Week projects while it was still in beta and then requested feedback after Hack Week was over. We were betting that if people found it made their lives easier, we’d gain even more momentum. We collected some valuable feedback over the course of Hack Week, but all in all, people were excited to have a framework that was easy to use. They’re hacks went a lot faster (and looked a lot better), and afterward we had a lot of folks clamoring for Solid to hit 1.0 so they could get it into our production environments.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe process continues\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Solid team still meets on a weekly basis, though the size of the group has decreased now that the guts of the product have been built. We review Jira issues, talk about tweaks we might want to make (big and small), as well as discuss adding new features. We know nothing we’ve built is set in stone, and that Solid is a living, breathing style guide that should and will evolve over time. Tech changes, BuzzFeed changes, and Solid will too.\u003c/p\u003e\u003cimg src=\"https://medium.com/_/stat?event=post.clientViewed\u0026referrerSource=full_rss\u0026postId=36d0232cd55c\" width=\"1\" height=\"1\"\u003e\u003chr\u003e\u003cp\u003e\u003ca href=\"https://medium.com/buzzfeed-design/building-solid-36d0232cd55c\"\u003eBuilding Solid\u003c/a\u003e was originally published in \u003ca href=\"https://medium.com/buzzfeed-design\"\u003eBuzzFeed Design\u003c/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c/p\u003e","link":"https://medium.com/buzzfeed-design/building-solid-36d0232cd55c?source=rss----60b3a6f3294f---4","published":"Tue, 15 Dec 2015 16:22:42 GMT","publishedParsed":"2015-12-15T16:22:42Z","author":{},"guid":"https://medium.com/p/36d0232cd55c","categories":["css","ux","design"],"dcExt":{"creator":["Allison (Chefec) Krausman"]},"extensions":{"atom":{"updated":[{"name":"updated","value":"2015-12-15T16:22:42.007Z","attrs":{},"children":{}}]},"dc":{"creator":[{"name":"creator","value":"Allison (Chefec) Krausman","attrs":{},"children":{}}]}}}],"feedType":"rss","feedVersion":"2.0"}